
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |          12 |          0 |
## Affected resources by action

|  Action  | Resources                                                                         |
|:--------:|:----------------------------------------------------------------------------------|
|    🟢    | `aws_iam_role_policy_attachment.registry-client["terraform-aws-github-backup"]`   |
|    🟢    | `module.registry-client-roles["terraform-aws-github-backup"].aws_iam_role.github` |
|    🟡    | `module.ecs.aws_ecs_capacity_provider.ecs`                                        |
|    🟡    | `module.ecs.aws_ecs_cluster.ecs`                                                  |
|    🟡    | `module.ecs.aws_ecs_service.ecs`                                                  |
|    🟡    | `module.ecs.aws_ecs_task_definition.ecs`                                          |
|    🟡    | `module.ecs.aws_iam_role.ecs_task_execution_role`                                 |
|    🟡    | `module.keycloak.aws_ecs_capacity_provider.ecs`                                   |
|    🟡    | `module.keycloak.aws_ecs_cluster.ecs`                                             |
|    🟡    | `module.keycloak.aws_ecs_service.ecs`                                             |
|    🟡    | `module.keycloak.aws_ecs_task_definition.ecs`                                     |
|    🟡    | `module.keycloak.aws_iam_role.ecs_task_execution_role`                            |
|    🟡    | `module.ecs.module.pod.aws_autoscaling_group.website`                             |
|    🟡    | `module.keycloak.module.pod.aws_autoscaling_group.website`                        |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.registry-client["terraform-aws-github-backup"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20240303235455581600000001"
      + role       = "ih-tf-terraform-aws-github-backup-github"
    }

  # module.ecs.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "terraform-registry"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "terraform-registry"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"
        name                               = "terraform-registry"
      ~ tags                               = {
            "account"                         = "493370826424"
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDRiOTM2MzgzNGUxM2EyM2UiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDQzZDAyZGRmYjk3NDU5ODAiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTBkZTEyMTE0ZDgwYWYwMmRlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTAwNDg5M2M3ZTFj"
            "created_by_module"               = "infrahouse/ecs/aws"
            "environment"                     = "development"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/terraform-registryTaskExecutionRole20241001134545661300000006"
            "instance_role_policy_attachment" = "terraform-registry-instance-u7h28mlvhf20241001134545584200000002-20241001134546521000000007"
            "instance_role_policy_name"       = "terraform-registry-instance-u7h28mlvhf2l20241001134545463900000001"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266"
          ~ "module_version"                  = "3.8.0" -> "3.8.1"
            "service"                         = "terraform-registry"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.8.0" -> "3.8.1"
            # (11 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "terraform-registry"
      ~ tags                     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "terraform-registry"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "terraform-registryTaskExecutionRole20241001134545661300000006"
        name                  = "terraform-registryTaskExecutionRole20241001134545661300000006"
      ~ tags                  = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "terraform-registry"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.keycloak.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth"
        name     = "auth"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "auth"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/auth"
        name     = "auth"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "auth"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"
        name                               = "auth"
      ~ tags                               = {
            "account"                         = "493370826424"
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDY1MzNlOTA2ZDc4NGIyYTUiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMGRhOTVkMzY4ZWMwYmNiZGIiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTA4NGE0YjRhNzk1NjI3NWU2IiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiYmI3OTIwMmRk"
            "created_by_module"               = "infrahouse/ecs/aws"
            "environment"                     = "development"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
            "instance_role_policy_attachment" = "auth-instance-czqdboofg13020241001134545613900000004-20241001134546591300000008"
            "instance_role_policy_name"       = "auth-instance-czqdboofg13020241001134545611100000003"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
          ~ "module_version"                  = "3.8.0" -> "3.8.1"
            "service"                         = "auth"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.8.0" -> "3.8.1"
            # (11 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.keycloak.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "auth"
      ~ tags                     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "auth"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.keycloak.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "authTaskExecutionRole20241001134545655900000005"
        name                  = "authTaskExecutionRole20241001134545655900000005"
      ~ tags                  = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            "service"           = "auth"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.8.0" -> "3.8.1"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.registry-client-roles["terraform-aws-github-backup"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-github-backup:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-github-backup"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-github-backup-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2024030219493674520000000d"
        name                             = "terraf2024030219493674520000000d"
        # (32 unchanged attributes hidden)

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.8.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.8.1"
        }

        # (11 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "auth2024030222363784960000000d"
        name                             = "auth2024030222363784960000000d"
        # (32 unchanged attributes hidden)

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.8.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.8.1"
        }

        # (11 unchanged blocks hidden)
    }

Plan: 2 to add, 12 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAxMiwgImRlc3Ryb3kiOiAwfX0=
```
</details>